grevaillot/svd_tools/headers/STM32H7B3x/fdcan.h
/** FDCAN_FDCAN_ILS_ARAL Access to Reserved Address Line **/
#define FDCAN_FDCAN_ILS_ARAL		(1 << 29)
/** FDCAN_FDCAN_ILS_PEDL Protocol Error in Data Phase Line **/
#define FDCAN_FDCAN_ILS_PEDL		(1 << 28)
/** FDCAN_FDCAN_ILS_PEAL Protocol Error in Arbitration Phase Line **/
#define FDCAN_FDCAN_ILS_PEAL		(1 << 27)
/** FDCAN_FDCAN_ILS_WDIL Watchdog Interrupt Line **/
#define FDCAN_FDCAN_ILS_WDIL		(1 << 26)
/** FDCAN_FDCAN_ILS_BOL Bus_Off Status **/
#define FDCAN_FDCAN_ILS_BOL		(1 << 25)
/** FDCAN_FDCAN_ILS_EWL Warning Status Interrupt Line **/
#define FDCAN_FDCAN_ILS_EWL		(1 << 24)
/** FDCAN_FDCAN_ILS_EPL Error Passive Interrupt Line **/
#define FDCAN_FDCAN_ILS_EPL		(1 << 23)
/** FDCAN_FDCAN_ILS_ELOL Error Logging Overflow Interrupt Line **/
#define FDCAN_FDCAN_ILS_ELOL		(1 << 22)
/** FDCAN_FDCAN_ILS_BEUL Bit Error Uncorrected Interrupt Line **/
#define FDCAN_FDCAN_ILS_BEUL		(1 << 21)
/** FDCAN_FDCAN_ILS_BECL Bit Error Corrected Interrupt Line **/
#define FDCAN_FDCAN_ILS_BECL		(1 << 20)
/** FDCAN_FDCAN_ILS_DRXL Message stored to Dedicated Rx Buffer Interrupt Line **/
#define FDCAN_FDCAN_ILS_DRXL		(1 << 19)
/** FDCAN_FDCAN_ILS_TOOL Timeout Occurred Interrupt Line **/
#define FDCAN_FDCAN_ILS_TOOL		(1 << 18)
/** FDCAN_FDCAN_ILS_MRAFL Message RAM Access Failure Interrupt Line **/
#define FDCAN_FDCAN_ILS_MRAFL		(1 << 17)
/** FDCAN_FDCAN_ILS_TSWL Timestamp Wraparound Interrupt Line **/
#define FDCAN_FDCAN_ILS_TSWL		(1 << 16)
/** FDCAN_FDCAN_ILS_TEFLL Tx Event FIFO Element Lost Interrupt Line **/
#define FDCAN_FDCAN_ILS_TEFLL		(1 << 15)
/** FDCAN_FDCAN_ILS_TEFFL Tx Event FIFO Full Interrupt Line **/
#define FDCAN_FDCAN_ILS_TEFFL		(1 << 14)
/** FDCAN_FDCAN_ILS_TEFWL Tx Event FIFO Watermark Reached Interrupt Line **/
#define FDCAN_FDCAN_ILS_TEFWL		(1 << 13)
/** FDCAN_FDCAN_ILS_TEFNL Tx Event FIFO New Entry Interrupt Line **/
#define FDCAN_FDCAN_ILS_TEFNL		(1 << 12)
/** FDCAN_FDCAN_ILS_TEFL Tx FIFO Empty Interrupt Line **/
#define FDCAN_FDCAN_ILS_TEFL		(1 << 11)
/** FDCAN_FDCAN_ILS_TCFL Transmission Cancellation Finished Interrupt Line **/
#define FDCAN_FDCAN_ILS_TCFL		(1 << 10)
/** FDCAN_FDCAN_ILS_TCL Transmission Completed Interrupt Line **/
#define FDCAN_FDCAN_ILS_TCL		(1 << 9)
/** FDCAN_FDCAN_ILS_HPML High Priority Message Interrupt Line **/
#define FDCAN_FDCAN_ILS_HPML		(1 << 8)
/** FDCAN_FDCAN_ILS_RF1LL Rx FIFO 1 Message Lost Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF1LL		(1 << 7)
/** FDCAN_FDCAN_ILS_RF1FL Rx FIFO 1 Full Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF1FL		(1 << 6)
/** FDCAN_FDCAN_ILS_RF1WL Rx FIFO 1 Watermark Reached Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF1WL		(1 << 5)
/** FDCAN_FDCAN_ILS_RF1NL Rx FIFO 1 New Message Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF1NL		(1 << 4)
/** FDCAN_FDCAN_ILS_RF0LL Rx FIFO 0 Message Lost Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF0LL		(1 << 3)
/** FDCAN_FDCAN_ILS_RF0FL Rx FIFO 0 Full Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF0FL		(1 << 2)
/** FDCAN_FDCAN_ILS_RF0WL Rx FIFO 0 Watermark Reached Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF0WL		(1 << 1)
/** FDCAN_FDCAN_ILS_RF0NL Rx FIFO 0 New Message Interrupt Line **/
#define FDCAN_FDCAN_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_ile FDCANILE FDCAN Interrupt Line Enable Register
@{*/

/** FDCAN_FDCAN_ILE_EINT1 Enable Interrupt Line 1 **/
#define FDCAN_FDCAN_ILE_EINT1		(1 << 1)
/** FDCAN_FDCAN_ILE_EINT0 Enable Interrupt Line 0 **/
#define FDCAN_FDCAN_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_gfc FDCANGFC FDCAN Global Filter Configuration Register
@{*/


#define FDCAN_FDCAN_GFC_ANFS_SHIFT		4
#define FDCAN_FDCAN_GFC_ANFS_MASK		0x03
/** @defgroup fdcan_fdcan_gfc_anfs ANFS Accept Non-matching Frames Standard
@{*/
/**@}*/


#define FDCAN_FDCAN_GFC_ANFE_SHIFT		2
#define FDCAN_FDCAN_GFC_ANFE_MASK		0x03
/** @defgroup fdcan_fdcan_gfc_anfe ANFE Accept Non-matching Frames Extended
@{*/
/**@}*/

/** FDCAN_FDCAN_GFC_RRFS Reject Remote Frames Standard **/
#define FDCAN_FDCAN_GFC_RRFS		(1 << 1)
/** FDCAN_FDCAN_GFC_RRFE Reject Remote Frames Extended **/
#define FDCAN_FDCAN_GFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_sidfc FDCANSIDFC FDCAN Standard ID Filter Configuration Register
@{*/


#define FDCAN_FDCAN_SIDFC_LSS_SHIFT		16
#define FDCAN_FDCAN_SIDFC_LSS_MASK		0xff
/** @defgroup fdcan_fdcan_sidfc_lss LSS List Size Standard
@{*/
/**@}*/


#define FDCAN_FDCAN_SIDFC_FLSSA_SHIFT		2
#define FDCAN_FDCAN_SIDFC_FLSSA_MASK		0x3fff
/** @defgroup fdcan_fdcan_sidfc_flssa FLSSA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_xidfc FDCANXIDFC FDCAN Extended ID Filter Configuration Register
@{*/


#define FDCAN_FDCAN_XIDFC_LSE_SHIFT		16
#define FDCAN_FDCAN_XIDFC_LSE_MASK		0xff
/** @defgroup fdcan_fdcan_xidfc_lse LSE List Size Extended
@{*/
/**@}*/


#define FDCAN_FDCAN_XIDFC_FLESA_SHIFT		2
#define FDCAN_FDCAN_XIDFC_FLESA_MASK		0x3fff
/** @defgroup fdcan_fdcan_xidfc_flesa FLESA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_xidam FDCANXIDAM FDCAN Extended ID and Mask Register
@{*/


#define FDCAN_FDCAN_XIDAM_EIDM_SHIFT		0
#define FDCAN_FDCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup fdcan_fdcan_xidam_eidm EIDM Extended ID Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_hpms FDCANHPMS FDCAN High Priority Message Status Register
@{*/

/** FDCAN_FDCAN_HPMS_FLST Filter List **/
#define FDCAN_FDCAN_HPMS_FLST		(1 << 15)

#define FDCAN_FDCAN_HPMS_FIDX_SHIFT		8
#define FDCAN_FDCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup fdcan_fdcan_hpms_fidx FIDX Filter Index
@{*/
/**@}*/


#define FDCAN_FDCAN_HPMS_MSI_SHIFT		6
#define FDCAN_FDCAN_HPMS_MSI_MASK		0x03
/** @defgroup fdcan_fdcan_hpms_msi MSI Message Storage Indicator
@{*/
/**@}*/


#define FDCAN_FDCAN_HPMS_BIDX_SHIFT		0
#define FDCAN_FDCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup fdcan_fdcan_hpms_bidx BIDX Buffer Index
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_ndat1 FDCANNDAT1 FDCAN New Data 1 Register
@{*/

/** FDCAN_FDCAN_NDAT1_ND31 New data **/
#define FDCAN_FDCAN_NDAT1_ND31		(1 << 31)
/** FDCAN_FDCAN_NDAT1_ND30 New data **/
#define FDCAN_FDCAN_NDAT1_ND30		(1 << 30)
/** FDCAN_FDCAN_NDAT1_ND29 New data **/
#define FDCAN_FDCAN_NDAT1_ND29		(1 << 29)
/** FDCAN_FDCAN_NDAT1_ND28 New data **/
#define FDCAN_FDCAN_NDAT1_ND28		(1 << 28)
/** FDCAN_FDCAN_NDAT1_ND27 New data **/
#define FDCAN_FDCAN_NDAT1_ND27		(1 << 27)
/** FDCAN_FDCAN_NDAT1_ND26 New data **/
#define FDCAN_FDCAN_NDAT1_ND26		(1 << 26)
/** FDCAN_FDCAN_NDAT1_ND25 New data **/
#define FDCAN_FDCAN_NDAT1_ND25		(1 << 25)
/** FDCAN_FDCAN_NDAT1_ND24 New data **/
#define FDCAN_FDCAN_NDAT1_ND24		(1 << 24)
/** FDCAN_FDCAN_NDAT1_ND23 New data **/
#define FDCAN_FDCAN_NDAT1_ND23		(1 << 23)
/** FDCAN_FDCAN_NDAT1_ND22 New data **/
#define FDCAN_FDCAN_NDAT1_ND22		(1 << 22)
/** FDCAN_FDCAN_NDAT1_ND21 New data **/
#define FDCAN_FDCAN_NDAT1_ND21		(1 << 21)
/** FDCAN_FDCAN_NDAT1_ND20 New data **/
#define FDCAN_FDCAN_NDAT1_ND20		(1 << 20)
/** FDCAN_FDCAN_NDAT1_ND19 New data **/
#define FDCAN_FDCAN_NDAT1_ND19		(1 << 19)
/** FDCAN_FDCAN_NDAT1_ND18 New data **/
#define FDCAN_FDCAN_NDAT1_ND18		(1 << 18)
/** FDCAN_FDCAN_NDAT1_ND17 New data **/
#define FDCAN_FDCAN_NDAT1_ND17		(1 << 17)
/** FDCAN_FDCAN_NDAT1_ND16 New data **/
#define FDCAN_FDCAN_NDAT1_ND16		(1 << 16)
/** FDCAN_FDCAN_NDAT1_ND15 New data **/
#define FDCAN_FDCAN_NDAT1_ND15		(1 << 15)
/** FDCAN_FDCAN_NDAT1_ND14 New data **/
#define FDCAN_FDCAN_NDAT1_ND14		(1 << 14)
/** FDCAN_FDCAN_NDAT1_ND13 New data **/
#define FDCAN_FDCAN_NDAT1_ND13		(1 << 13)
/** FDCAN_FDCAN_NDAT1_ND12 New data **/
#define FDCAN_FDCAN_NDAT1_ND12		(1 << 12)
/** FDCAN_FDCAN_NDAT1_ND11 New data **/
#define FDCAN_FDCAN_NDAT1_ND11		(1 << 11)
/** FDCAN_FDCAN_NDAT1_ND10 New data **/
#define FDCAN_FDCAN_NDAT1_ND10		(1 << 10)
/** FDCAN_FDCAN_NDAT1_ND9 New data **/
#define FDCAN_FDCAN_NDAT1_ND9		(1 << 9)
/** FDCAN_FDCAN_NDAT1_ND8 New data **/
#define FDCAN_FDCAN_NDAT1_ND8		(1 << 8)
/** FDCAN_FDCAN_NDAT1_ND7 New data **/
#define FDCAN_FDCAN_NDAT1_ND7		(1 << 7)
/** FDCAN_FDCAN_NDAT1_ND6 New data **/
#define FDCAN_FDCAN_NDAT1_ND6		(1 << 6)
/** FDCAN_FDCAN_NDAT1_ND5 New data **/
#define FDCAN_FDCAN_NDAT1_ND5		(1 << 5)
/** FDCAN_FDCAN_NDAT1_ND4 New data **/
#define FDCAN_FDCAN_NDAT1_ND4		(1 << 4)
/** FDCAN_FDCAN_NDAT1_ND3 New data **/
#define FDCAN_FDCAN_NDAT1_ND3		(1 << 3)
/** FDCAN_FDCAN_NDAT1_ND2 New data **/
#define FDCAN_FDCAN_NDAT1_ND2		(1 << 2)
/** FDCAN_FDCAN_NDAT1_ND1 New data **/
#define FDCAN_FDCAN_NDAT1_ND1		(1 << 1)
/** FDCAN_FDCAN_NDAT1_ND0 New data **/
#define FDCAN_FDCAN_NDAT1_ND0		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_ndat2 FDCANNDAT2 FDCAN New Data 2 Register
@{*/

/** FDCAN_FDCAN_NDAT2_ND63 New data **/
#define FDCAN_FDCAN_NDAT2_ND63		(1 << 31)
/** FDCAN_FDCAN_NDAT2_ND62 New data **/
#define FDCAN_FDCAN_NDAT2_ND62		(1 << 30)
/** FDCAN_FDCAN_NDAT2_ND61 New data **/
#define FDCAN_FDCAN_NDAT2_ND61		(1 << 29)
/** FDCAN_FDCAN_NDAT2_ND60 New data **/
#define FDCAN_FDCAN_NDAT2_ND60		(1 << 28)
/** FDCAN_FDCAN_NDAT2_ND59 New data **/
#define FDCAN_FDCAN_NDAT2_ND59		(1 << 27)
/** FDCAN_FDCAN_NDAT2_ND58 New data **/
#define FDCAN_FDCAN_NDAT2_ND58		(1 << 26)
/** FDCAN_FDCAN_NDAT2_ND57 New data **/
#define FDCAN_FDCAN_NDAT2_ND57		(1 << 25)
/** FDCAN_FDCAN_NDAT2_ND56 New data **/
#define FDCAN_FDCAN_NDAT2_ND56		(1 << 24)
/** FDCAN_FDCAN_NDAT2_ND55 New data **/
#define FDCAN_FDCAN_NDAT2_ND55		(1 << 23)
/** FDCAN_FDCAN_NDAT2_ND54 New data **/
#define FDCAN_FDCAN_NDAT2_ND54		(1 << 22)
/** FDCAN_FDCAN_NDAT2_ND53 New data **/
#define FDCAN_FDCAN_NDAT2_ND53		(1 << 21)
/** FDCAN_FDCAN_NDAT2_ND52 New data **/
#define FDCAN_FDCAN_NDAT2_ND52		(1 << 20)
/** FDCAN_FDCAN_NDAT2_ND51 New data **/
#define FDCAN_FDCAN_NDAT2_ND51		(1 << 19)
/** FDCAN_FDCAN_NDAT2_ND50 New data **/
#define FDCAN_FDCAN_NDAT2_ND50		(1 << 18)
/** FDCAN_FDCAN_NDAT2_ND49 New data **/
#define FDCAN_FDCAN_NDAT2_ND49		(1 << 17)
/** FDCAN_FDCAN_NDAT2_ND48 New data **/
#define FDCAN_FDCAN_NDAT2_ND48		(1 << 16)
/** FDCAN_FDCAN_NDAT2_ND47 New data **/
#define FDCAN_FDCAN_NDAT2_ND47		(1 << 15)
/** FDCAN_FDCAN_NDAT2_ND46 New data **/
#define FDCAN_FDCAN_NDAT2_ND46		(1 << 14)
/** FDCAN_FDCAN_NDAT2_ND45 New data **/
#define FDCAN_FDCAN_NDAT2_ND45		(1 << 13)
/** FDCAN_FDCAN_NDAT2_ND44 New data **/
#define FDCAN_FDCAN_NDAT2_ND44		(1 << 12)
/** FDCAN_FDCAN_NDAT2_ND43 New data **/
#define FDCAN_FDCAN_NDAT2_ND43		(1 << 11)
/** FDCAN_FDCAN_NDAT2_ND42 New data **/
#define FDCAN_FDCAN_NDAT2_ND42		(1 << 10)
/** FDCAN_FDCAN_NDAT2_ND41 New data **/
#define FDCAN_FDCAN_NDAT2_ND41		(1 << 9)
/** FDCAN_FDCAN_NDAT2_ND40 New data **/
#define FDCAN_FDCAN_NDAT2_ND40		(1 << 8)
/** FDCAN_FDCAN_NDAT2_ND39 New data **/
#define FDCAN_FDCAN_NDAT2_ND39		(1 << 7)
/** FDCAN_FDCAN_NDAT2_ND38 New data **/
#define FDCAN_FDCAN_NDAT2_ND38		(1 << 6)
/** FDCAN_FDCAN_NDAT2_ND37 New data **/
#define FDCAN_FDCAN_NDAT2_ND37		(1 << 5)
/** FDCAN_FDCAN_NDAT2_ND36 New data **/
#define FDCAN_FDCAN_NDAT2_ND36		(1 << 4)
/** FDCAN_FDCAN_NDAT2_ND35 New data **/
#define FDCAN_FDCAN_NDAT2_ND35		(1 << 3)
/** FDCAN_FDCAN_NDAT2_ND34 New data **/
#define FDCAN_FDCAN_NDAT2_ND34		(1 << 2)
/** FDCAN_FDCAN_NDAT2_ND33 New data **/
#define FDCAN_FDCAN_NDAT2_ND33		(1 << 1)
/** FDCAN_FDCAN_NDAT2_ND32 New data **/
#define FDCAN_FDCAN_NDAT2_ND32		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_rxf0c FDCANRXF0C FDCAN Rx FIFO 0 Configuration Register
@{*/


#define FDCAN_FDCAN_RXF0C_F0WM_SHIFT		24
#define FDCAN_FDCAN_RXF0C_F0WM_MASK		0xff
/** @defgroup fdcan_fdcan_rxf0c_f0wm F0WM FIFO 0 Watermark
@{*/
/**@}*/


#define FDCAN_FDCAN_RXF0C_F0S_SHIFT		16
#define FDCAN_FDCAN_RXF0C_F0S_MASK		0xff
/** @defgroup fdcan_fdcan_rxf0c_f0s F0S Rx FIFO 0 Size
@{*/
/**@}*/


#define FDCAN_FDCAN_RXF0C_F0SA_SHIFT		2
#define FDCAN_FDCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup fdcan_fdcan_rxf0c_f0sa F0SA Rx FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_rxf0s FDCANRXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** FDCAN_FDCAN_RXF0S_RF0L Rx FIFO 0 Message Lost **/
#define FDCAN_FDCAN_RXF0S_RF0L		(1 << 25)
/** FDCAN_FDCAN_RXF0S_F0F Rx FIFO 0 Full **/
#define FDCAN_FDCAN_RXF0S_F0F		(1 << 24)

#define FDCAN_FDCAN_RXF0S_F0P_SHIFT		16
#define FDCAN_FDCAN_RXF0S_F0P_MASK		0x3f
/** @defgroup fdcan_fdcan_rxf0s_f0p F0P Rx FIFO 0 Put Index
@{*/
/**@}*/


#define FDCAN_FDCAN_RXF0S_F0G_SHIFT		8
#define FDCAN_FDCAN_RXF0S_F0G_MASK		0x3f
/** @defgroup fdcan_fdcan_rxf0s_f0g F0G Rx FIFO 0 Get Index
@{*/
/**@}*/


#define FDCAN_FDCAN_RXF0S_F0FL_SHIFT		0
#define FDCAN_FDCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup fdcan_fdcan_rxf0s_f0fl F0FL Rx FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

