grevaillot/svd_tools/headers/STM32H7B3x/fdcan.h
/** FDCAN_FDCAN_TTOCN_SWP Stop Watch Polarity **/
#define FDCAN_FDCAN_TTOCN_SWP		(1 << 2)
/** FDCAN_FDCAN_TTOCN_ECS External Clock Synchronization **/
#define FDCAN_FDCAN_TTOCN_ECS		(1 << 1)
/** FDCAN_FDCAN_TTOCN_SGT Set Global time **/
#define FDCAN_FDCAN_TTOCN_SGT		(1 << 0)

/**@}*/

/** @defgroup fdcan_can_ttgtp CANTTGTP FDCAN TT Global Time Preset Register
@{*/


#define FDCAN_CAN_TTGTP_CTP_SHIFT		16
#define FDCAN_CAN_TTGTP_CTP_MASK		0xffff
/** @defgroup fdcan_can_ttgtp_ctp CTP Cycle Time Target Phase
@{*/
/**@}*/


#define FDCAN_CAN_TTGTP_NCL_SHIFT		0
#define FDCAN_CAN_TTGTP_NCL_MASK		0xffff
/** @defgroup fdcan_can_ttgtp_ncl NCL Time Preset
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_tttmk FDCANTTTMK FDCAN TT Time Mark Register
@{*/

/** FDCAN_FDCAN_TTTMK_LCKM TT Time Mark Register Locked **/
#define FDCAN_FDCAN_TTTMK_LCKM		(1 << 31)

#define FDCAN_FDCAN_TTTMK_TICC_SHIFT		16
#define FDCAN_FDCAN_TTTMK_TICC_MASK		0x7f
/** @defgroup fdcan_fdcan_tttmk_ticc TICC Time Mark Cycle Code
@{*/
/**@}*/


#define FDCAN_FDCAN_TTTMK_TM_SHIFT		0
#define FDCAN_FDCAN_TTTMK_TM_MASK		0xffff
/** @defgroup fdcan_fdcan_tttmk_tm TM Time Mark
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan_fdcan_ttir FDCANTTIR FDCAN TT Interrupt Register
@{*/

/** FDCAN_FDCAN_TTIR_CER Configuration Error **/
#define FDCAN_FDCAN_TTIR_CER		(1 << 18)
/** FDCAN_FDCAN_TTIR_AW Application Watchdog **/
#define FDCAN_FDCAN_TTIR_AW		(1 << 17)
/** FDCAN_FDCAN_TTIR_WT Watch Trigger **/
#define FDCAN_FDCAN_TTIR_WT		(1 << 16)
/** FDCAN_FDCAN_TTIR_IWTG Initialization Watch Trigger **/
#define FDCAN_FDCAN_TTIR_IWTG		(1 << 15)
/** FDCAN_FDCAN_TTIR_ELC Error Level Changed. **/
#define FDCAN_FDCAN_TTIR_ELC		(1 << 14)
/** FDCAN_FDCAN_TTIR_SE2 Scheduling Error 2 **/
#define FDCAN_FDCAN_TTIR_SE2		(1 << 13)
/** FDCAN_FDCAN_TTIR_SE1 Scheduling Error 1 **/
#define FDCAN_FDCAN_TTIR_SE1		(1 << 12)
/** FDCAN_FDCAN_TTIR_TXO Tx Count Overflow **/
#define FDCAN_FDCAN_TTIR_TXO		(1 << 11)
/** FDCAN_FDCAN_TTIR_TXU Tx Count Underflow **/
#define FDCAN_FDCAN_TTIR_TXU		(1 << 10)
/** FDCAN_FDCAN_TTIR_GTE Global Time Error **/
#define FDCAN_FDCAN_TTIR_GTE		(1 << 9)
/** FDCAN_FDCAN_TTIR_GTD Global Time Discontinuity **/
#define FDCAN_FDCAN_TTIR_GTD		(1 << 8)
/** FDCAN_FDCAN_TTIR_GTW Global Time Wrap **/
#define FDCAN_FDCAN_TTIR_GTW		(1 << 7)
/** FDCAN_FDCAN_TTIR_SWE Stop Watch Event **/
#define FDCAN_FDCAN_TTIR_SWE		(1 << 6)
/** FDCAN_FDCAN_TTIR_TTMI Trigger Time Mark Event Internal **/
#define FDCAN_FDCAN_TTIR_TTMI		(1 << 5)
/** FDCAN_FDCAN_TTIR_RTMI Register Time Mark Interrupt. **/
#define FDCAN_FDCAN_TTIR_RTMI		(1 << 4)
/** FDCAN_FDCAN_TTIR_SOG Start of Gap **/
#define FDCAN_FDCAN_TTIR_SOG		(1 << 3)
/** FDCAN_FDCAN_TTIR_CSM Change of Synchronization Mode **/
#define FDCAN_FDCAN_TTIR_CSM		(1 << 2)
/** FDCAN_FDCAN_TTIR_SMC Start of Matrix Cycle **/
#define FDCAN_FDCAN_TTIR_SMC		(1 << 1)
/** FDCAN_FDCAN_TTIR_SBC Start of Basic Cycle **/
#define FDCAN_FDCAN_TTIR_SBC		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_ttie FDCANTTIE FDCAN TT Interrupt Enable Register
@{*/

/** FDCAN_FDCAN_TTIE_CERE Configuration Error Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_CERE		(1 << 18)
/** FDCAN_FDCAN_TTIE_AWE Application Watchdog Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_AWE		(1 << 17)
/** FDCAN_FDCAN_TTIE_WTE Watch Trigger Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_WTE		(1 << 16)
/** FDCAN_FDCAN_TTIE_IWTGE Initialization Watch Trigger Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_IWTGE		(1 << 15)
/** FDCAN_FDCAN_TTIE_ELCE Change Error Level Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_ELCE		(1 << 14)
/** FDCAN_FDCAN_TTIE_SE2E Scheduling Error 2 Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SE2E		(1 << 13)
/** FDCAN_FDCAN_TTIE_SE1E Scheduling Error 1 Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SE1E		(1 << 12)
/** FDCAN_FDCAN_TTIE_TXOE Tx Count Overflow Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_TXOE		(1 << 11)
/** FDCAN_FDCAN_TTIE_TXUE Tx Count Underflow Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_TXUE		(1 << 10)
/** FDCAN_FDCAN_TTIE_GTEE Global Time Error Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_GTEE		(1 << 9)
/** FDCAN_FDCAN_TTIE_GTDE Global Time Discontinuity Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_GTDE		(1 << 8)
/** FDCAN_FDCAN_TTIE_GTWE Global Time Wrap Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_GTWE		(1 << 7)
/** FDCAN_FDCAN_TTIE_SWEE Stop Watch Event Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SWEE		(1 << 6)
/** FDCAN_FDCAN_TTIE_TTMIE Trigger Time Mark Event Internal Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_TTMIE		(1 << 5)
/** FDCAN_FDCAN_TTIE_RTMIE Register Time Mark Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_RTMIE		(1 << 4)
/** FDCAN_FDCAN_TTIE_SOGE Start of Gap Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SOGE		(1 << 3)
/** FDCAN_FDCAN_TTIE_CSME Change of Synchronization Mode Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_CSME		(1 << 2)
/** FDCAN_FDCAN_TTIE_SMCE Start of Matrix Cycle Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SMCE		(1 << 1)
/** FDCAN_FDCAN_TTIE_SBCE Start of Basic Cycle Interrupt Enable **/
#define FDCAN_FDCAN_TTIE_SBCE		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_ttils FDCANTTILS FDCAN TT Interrupt Line Select Register
@{*/

/** FDCAN_FDCAN_TTILS_CERL Configuration Error Interrupt Line **/
#define FDCAN_FDCAN_TTILS_CERL		(1 << 18)
/** FDCAN_FDCAN_TTILS_AWL Application Watchdog Interrupt Line **/
#define FDCAN_FDCAN_TTILS_AWL		(1 << 17)
/** FDCAN_FDCAN_TTILS_WTL Watch Trigger Interrupt Line **/
#define FDCAN_FDCAN_TTILS_WTL		(1 << 16)
/** FDCAN_FDCAN_TTILS_IWTGL Initialization Watch Trigger Interrupt Line **/
#define FDCAN_FDCAN_TTILS_IWTGL		(1 << 15)
/** FDCAN_FDCAN_TTILS_ELCL Change Error Level Interrupt Line **/
#define FDCAN_FDCAN_TTILS_ELCL		(1 << 14)
/** FDCAN_FDCAN_TTILS_SE2L Scheduling Error 2 Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SE2L		(1 << 13)
/** FDCAN_FDCAN_TTILS_SE1L Scheduling Error 1 Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SE1L		(1 << 12)
/** FDCAN_FDCAN_TTILS_TXOL Tx Count Overflow Interrupt Line **/
#define FDCAN_FDCAN_TTILS_TXOL		(1 << 11)
/** FDCAN_FDCAN_TTILS_TXUL Tx Count Underflow Interrupt Line **/
#define FDCAN_FDCAN_TTILS_TXUL		(1 << 10)
/** FDCAN_FDCAN_TTILS_GTEL Global Time Error Interrupt Line **/
#define FDCAN_FDCAN_TTILS_GTEL		(1 << 9)
/** FDCAN_FDCAN_TTILS_GTDL Global Time Discontinuity Interrupt Line **/
#define FDCAN_FDCAN_TTILS_GTDL		(1 << 8)
/** FDCAN_FDCAN_TTILS_GTWL Global Time Wrap Interrupt Line **/
#define FDCAN_FDCAN_TTILS_GTWL		(1 << 7)
/** FDCAN_FDCAN_TTILS_SWEL Stop Watch Event Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SWEL		(1 << 6)
/** FDCAN_FDCAN_TTILS_TTMIL Trigger Time Mark Event Internal Interrupt Line **/
#define FDCAN_FDCAN_TTILS_TTMIL		(1 << 5)
/** FDCAN_FDCAN_TTILS_RTMIL Register Time Mark Interrupt Line **/
#define FDCAN_FDCAN_TTILS_RTMIL		(1 << 4)
/** FDCAN_FDCAN_TTILS_SOGL Start of Gap Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SOGL		(1 << 3)
/** FDCAN_FDCAN_TTILS_CSML Change of Synchronization Mode Interrupt Line **/
#define FDCAN_FDCAN_TTILS_CSML		(1 << 2)
/** FDCAN_FDCAN_TTILS_SMCL Start of Matrix Cycle Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SMCL		(1 << 1)
/** FDCAN_FDCAN_TTILS_SBCL Start of Basic Cycle Interrupt Line **/
#define FDCAN_FDCAN_TTILS_SBCL		(1 << 0)

/**@}*/

/** @defgroup fdcan_fdcan_ttost FDCANTTOST FDCAN TT Operation Status Register
@{*/

/** FDCAN_FDCAN_TTOST_SPL Schedule Phase Lock **/
#define FDCAN_FDCAN_TTOST_SPL		(1 << 31)
/** FDCAN_FDCAN_TTOST_WECS Wait for External Clock Synchronization **/
#define FDCAN_FDCAN_TTOST_WECS		(1 << 30)
/** FDCAN_FDCAN_TTOST_AWE Application Watchdog Event **/
#define FDCAN_FDCAN_TTOST_AWE		(1 << 29)
/** FDCAN_FDCAN_TTOST_WFE Wait for Event **/
#define FDCAN_FDCAN_TTOST_WFE		(1 << 28)
/** FDCAN_FDCAN_TTOST_GSI Gap Started Indicator. **/
#define FDCAN_FDCAN_TTOST_GSI		(1 << 27)

